#include "TXLib.h"

void Rectangle_3D (int x, int y, int z);

int main ()
    {
    txCreateWindow (1500, 1000);
    Rectangle_3D (750, 500, 625);
    }

void Rectangle_3D (int x, int y, int z);
    {
    txLine (x - 25, y + 25, x + 25, y - 25); //z = (z - 25, z - 25), переднее (нижнее)  ребро
    txLine (x + 25, y + 25, x + 25, y - 25); //z = (z - 25, z - 25), переднее (правое)  ребро
    txLine (x - 25, y + 25, x + 25, y + 25); //z = (z - 25, z - 25), переднее (верхнее) ребро
    txLine (x - 25, y - 25, x - 25, y + 25); //z = (z - 25, z - 25), переднее (левое)   ребро
    txLine (x + 25, y - 25, x + 25, y - 25); //z = (z - 25, z + 25), боковое правое (нижнее)  ребро
    txLine (x + 25, y - 25, x + 25, y + 25); //z = (z + 25, z + 25), боковое правое (правое)  ребро
    txLine (x + 25, y + 25, x + 25, y + 25); //z = (z + 25, z + 25), боковое правое (верхнее) ребро
    txLine ();                               //z = (z + 25, z + 25), верхнее (правое) ребро
    txLine ();                               //z = (z + 25, z + 25), верхнее правое (правое) ребро
    txLine ();                               //z = (z + 25, z + 25), боковое правое (правое) ребро
    txLine ();                               //z = (z + 25, z + 25), боковое правое (правое) ребро
    txLine ();                               //z = (z + 25, z + 25), боковое правое (правое) ребро
    }
